# -*- ispell-local-dictionary: "en_US" -*-
#+TITLE:My Emacs Literate Config
#+AUTHOR: L. Gualdi
#+LANGUAGE: en
#+PROPERTY: header-args :tangle "~/.emacs.d/init.el"  :exports code

**** Tree-sitter

[[https://tree-sitter.github.io]]

Tree-sitter is builtin starting Emacs 29.

To use tree-sitter on windows, you need a C compiler to compile language's
grammar. You can install =gcc= with MSYS2 and modify your PATH accordingly.

You can check if the compiler is found directly in emacs by executing this command :
#+begin_src elisp :tangle no
  M-: (executable-find "gcc")
#+end_src

#+RESULTS:
: c:/msys64/mingw64/bin/gcc.exe

To install a grammar. You must call :
#+begin_src elisp :tangle no
  M-x treesit-install-language-grammar
#+end_src

You can then type the language (ex: typescript). If there is no recipe to
compile the grammar directly, emacs will prompt you all the questions to
download and compile the grammar.

The following config was taken from

#+begin_src elisp
  (use-package treesit
    :mode (("\\.tsx\\'" . tsx-ts-mode)
           ("\\.js\\'"  . typescript-ts-mode)
           ("\\.mjs\\'" . typescript-ts-mode)
           ("\\.mts\\'" . typescript-ts-mode)
           ("\\.cjs\\'" . typescript-ts-mode)
           ("\\.ts\\'"  . typescript-ts-mode)
           ("\\.jsx\\'" . tsx-ts-mode)
           ("\\.json\\'" . json-ts-mode)
           ;; More modes defined here...
           )
    :preface
    (defun os/setup-install-grammars ()
      "Install Tree-sitter grammars if they are absent."
      (interactive)
      (dolist (grammar
               '((css . ("https://github.com/tree-sitter/tree-sitter-css" "v0.23.2"))
                 (html . ("https://github.com/tree-sitter/tree-sitter-html" "v0.23.2"))
                 (javascript . ("https://github.com/tree-sitter/tree-sitter-javascript" "v0.23.1" "src"))
                 (json . ("https://github.com/tree-sitter/tree-sitter-json" "v0.24.8"))
                 (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "v0.23.1" "tsx/src"))
                 (typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "v0.23.1" "typescript/src"))
                 ))

        (add-to-list 'treesit-language-source-alist grammar)
        ;; Only install `grammar' if we don't already have it
        ;; installed. However, if you want to *update* a grammar then
        ;; this obviously prevents that from happening.
        (unless (treesit-language-available-p (car grammar))
          (treesit-install-language-grammar (car grammar)))))

    ;; Optional, but recommended. Tree-sitter enabled major modes are
    ;; distinct from their ordinary counterparts.
    ;;
    ;; You can remap major modes with `major-mode-remap-alist'. Note
    ;; that this does *not* extend to hooks! Make sure you migrate them
    ;; also
    (dolist (mapping
             '((css-mode . css-ts-mode)
               (typescript-mode . typescript-ts-mode)
               (js-mode . typescript-ts-mode)
               (js2-mode . typescript-ts-mode)
               (json-mode . json-ts-mode)
               (js-json-mode . json-ts-mode)))
      (add-to-list 'major-mode-remap-alist mapping))
    :config
    (os/setup-install-grammars))
#+end_src

